"""Homework"""
first_name = "Олег"
last_name = "Агеев"
text = f'\t Привет! Меня зовут {first_name} {last_name}, я обучаюсь програмированию на базе Python в Академии "Топ". Изучать програмирование я начал в этом году. \n \t Когда я ещё был в детском саду, нас спрашивали кем мы хотим быть, когда вырастем? И я сказал, что хочу быть програмистом. Я всегда думал, что это всего лишь детская мечта и я не способен это понять, но за то короткое время, что я пробыл здесь, мне действительно нравится обучение и я начинаю понемногу понимать как всё работает. \n \t Я надеюсь, что рано или поздо моя детская мечка сбудется хотя бы отчасти.'
print(text)
